app/controllers/branches_controller.rb

  def index
    @branches = Branch.all
---
SELECT "branches".* FROM "branches"